SPYFALL_LOCATIONS = {
    "유람선": ["선장", "주방장", "기관사", "조타수", "일등석 승객", "카지노 딜러", "바텐더"],
    "우주 정거장": ["우주비행사", "외계인 연구학자", "시스템 엔지니어", "우주 의사", "우주 관광객", "통신 장교", "파일럿"],
    "병원": ["외과의사", "간호사", "보호자", "환자", "구급차 운전기사", "물리치료사", "병원장"],
    "경찰서": ["형사", "법의학자", "취조 중인 절도범", "교통경찰", "변호사", "경찰서장", "기자"],
    "학교": ["교장", "급식 조리사", "사서 선생님", "전학생", "학생회장", "매점 주인", "양호 선생님"],
    "영화 촬영장": ["감독", "주연 배우", "스턴트맨", "카메라 감독", "조명 감독", "분장사", "제작사 대표"],
    "동물원": ["사육사", "수의사", "어린이 관람객", "매표소 직원", "기념품 판매원", "동물 행동 전문가", "경비원"],
    "은행": ["지점장", "창구 직원", "보안요원", "복면 쓴 강도", "현금수송요원", "VIP 고객", "청소부"],
    "레스토랑": ["수석 셰프", "부주방장", "소믈리에", "웨이터", "악사(연주자)", "미식가", "예약 손님"],
    "해적선": ["해적 선장", "항해사", "포수", "갑판장", "포로", "선의(의사)", "망보기 담당"]
}