import random

WORDS = {
    "과일": ["사과", "바나나", "포도", "딸기", "수박", "복숭아", "파인애플", "오렌지", "망고", "체리", "참외", "멜론", "자두", "키위"],
    "동물": ["사자", "호랑이", "코끼리", "기린", "원숭이", "강아지", "고양이", "토끼", "다람쥐", "얼룩말", "펭귄", "독수리", "돼지", "소"],
    "국가": ["대한민국", "미국", "일본", "중국", "영국", "프랑스", "독일", "이탈리아", "캐나다", "호주", "브라질", "스페인", "스위스"],
    "직업": ["경찰관", "소방관", "의사", "간호사", "선생님", "프로그래머", "변호사", "요리사", "가수", "배우", "대통령", "군인", "판사"],
    "스포츠": ["축구", "농구", "야구", "배구", "수영", "테니스", "배드민턴", "볼링", "탁구", "마라톤", "태권도", "유도", "골프"]
}

def get_chosung(text):
    CHOSUNG_LIST = ['ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']
    result = ""
    for char in text:
        if '가' <= char <= '힣':
            char_code = ord(char) - 0xAC00
            chosung_index = char_code // 588
            result += CHOSUNG_LIST[chosung_index]
        else:
            result += char
    return result
