SPYFALL_LOCATIONS = {
    "유람선": ["선장", "요리사", "기관사", "조타수", "일등석 승객", "엔터테이너", "바텐더"],
    "우주 정거장": ["우주비행사", "외계인 연구학자", "엔지니어", "의사", "우주 관광객", "보안요원", "파일럿"],
    "병원": ["외과의사", "간호사", "마취과 의사", "환자", "원무과 직원", "물리치료사", "병원장"],
    "경찰서": ["형사", "법의학자", "용의자", "순경", "변호사", "서장", "기자"],
    "학교": ["교장", "국어 선생님", "수학 선생님", "체육 선생님", "전교회장", "불량학생", "양호 선생님"],
    "영화 촬영장": ["감독", "주연 배우", "스턴트맨", "카메라 감독", "조명 감독", "분장사", "엑스트라"],
    "동물원": ["사육사", "수의사", "관람객", "안내원", "매점 직원", "동물 행동 전문가", "경비원"],
    "은행": ["지점장", "창구 직원", "보안요원", "VIP 고객", "현금수송요원", "대출 상담사", "자산관리사"],
    "레스토랑": ["수석 셰프", "부주방장", "소믈리에", "웨이터", "매니저", "미식가", "단골 손님"],
    "해적선": ["해적 선장", "항해사", "포수", "요리사", "갑판원", "포로", "선의"]
}
